benchmarks/results/20260804-235333-vs-nginx/mine-large-file-c10.txt
Running 10s test @ http://127.0.0.1:8080/benchmark-large.bin
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.31ms    3.63ms  61.35ms   83.51%
    Req/Sec   227.82     26.53   277.00     74.49%
  Latency Distribution
     50%    6.83ms
     75%    9.07ms
     90%   10.51ms
     99%   20.92ms
  9125 requests in 10.06s, 71.29GB read
Requests/sec:    906.87
Transfer/sec:      7.09GB