benchmarks/results/20260804-235333-vs-nginx/nginx-small-file-c200.txt
Running 10s test @ http://127.0.0.1:8081/hello.txt
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.43ms   73.59ms 761.17ms   95.81%
    Req/Sec    12.11k     5.29k   23.58k    62.78%
  Latency Distribution
     50%    3.09ms
     75%    7.32ms
     90%   21.57ms
     99%  468.26ms
  480629 requests in 10.09s, 237.89MB read
Requests/sec:  47613.00
Transfer/sec:     23.57MB